{
  "dadjokes": [
    "I love telling Dad jokes. Sometimes, he even laughs.",
    "My wife told me she didn't understand cloning. I told her, \"That makes two of us.\"",
    "My friend claims he glued himself to his autobiography. I don't believe him, but that's his story and he's sticking to it.",
    "I told my wife that a husband is like a fine wine: we just get better with age. The next day she locked me in the cellar.",
    "I slept like a log last night. Woke up in the fireplace!",
    "Did you hear Bruce Springsteen changed the lyrics to one of his songs? What’s he going to change next—his hair? His clothes? His face?",
    "What is a guitar player's favorite Italian food? Strum-boli.",
    "Why shouldn’t you trust trees? They seem shady.",
    "Did you hear about the man who cut off his left leg? He’s all right now.",
    "Did you hear about the truck transporting steaks that got into a wreck? Some car T-Boned it.",
    "What do you call a shoe made out of a banana? A slipper.",
    "A policy officer caught two kids playing with a firework and a car battery. He charged one and let the other off.",
    "Can February March? No, but April May!",
    "When a toddler reaches the \"why?\" stage, it's like opening a bottle of champagne—once it's uncorked, there's no going back.",
    "Why did the orange stop halfway across the road? It ran out of juice.",
    "I used to run a dating service for chickens, but I was struggling to make hens meet.",
    "Swords will never go obsolete. They're cutting edge technology.",
    "What's orange and sounds like a parrot? A carrot!",
    "You used to be able to get air for free at gas stations, but now it's a $1. That's inflation for you.",
    "Can a kangaroo jump higher than a house? Of course, houses can't jump.",
    "I bought Spotify premium for an uninterrupted music experience. But I still hear my wife’s bickering between songs.",
    "Justice is a dish best served cold. If it were served warm, it would be justwater.",
    "Mom texted me from the grocery store to say they’re out of pasta, and we’re penneless.",
    "I have a joke about construction, but I’m still working on it.",
    "The rotation of earth really makes my day.",
    "Why was the big cat disqualified from the race? Because it was a cheetah!",
    "My wife told me to quit doing my terrible Arnold impression, but don't worry, I'll return.",
    "Why do dragons sleep during the day? Because they like to fight knights.",
    "Where do boats go when they’re sick? To the dock.",
    "My ex and I had a very amicable divorce. I know this because when I posted on Facebook, “I’m getting a divorce,” she was the first one to like it.",
    "This graveyard looks overcrowded. People must be dying to get in there.",
    "“I bought the world’s worst thesaurus yesterday. Not only is it terrible, it’s terrible.”",
    "Why do melons have weddings? Because they cantaloupe.",
    "What did the grape do when he got stepped on? He let out a little wine.",
    "What do you call it when James Bond takes a bath? Bubble 07.",
    "What is a calendar’s favorite food? Dates.",
    "My wife just completed a 40 week bodybuilding program this morning. It's a girl and weighs 7lbs 12 oz.",
    "I'm reading a book about anti-gravity. It's impossible to put down.",
    "What’s the leading cause of dry skin? Towels.",
    "Why didn’t the astronaut come home to his wife? He needed his space.",
    "Just burned 2,000 calories. That’s the last time I leave brownies in the oven while I nap.",
    "Why couldn’t the toilet paper cross the road? It got stuck in a crack.",
    "Why don’t crabs give to charity? Because they are shellfish!",
    "Dad, did you get a haircut? No, I got them all cut.",
    "What did Benjamin Franklin say when he discovered electricity? Nothing. He was too shocked.",
    "How many tickles does it take to make an octopus laugh? Ten tickles.",
    "What’s the difference between a wizard who raises the undead and a sexy vampire? One is a necromancer and the other is a neck romancer.",
    "What's the difference between a well-dressed man on a unicycle and a poorly-dressed man on a bicycle? Attire.",
    "I went to a seafood disco last week! Pulled a mussel!",
    "What did the baby corn say to the mama corn? Where's popcorn?",
    "Which knight of the round table was the beefiest? Sir loin.",
    "What sits on the seabed and has anxiety? A nervous wreck.",
    "What do you call a cheese that isn’t yours? Nacho cheese!",
    "What do you get from a pampered cow? Spoiled milk.",
    "My wife says nothing rhymes with “orange.” And I said, “No, it doesn’t!”",
    "Want to hear a joke about construction? I'm still working on it.",
    "My wife and I let astrology get between us. It Taurus apart.",
    "What’s brown and sticky? A stick.",
    "I can always tell when my wife is lying just by looking at her. I can also tell when she’s standing.",
    "I needed a password eight characters long, so I picked Snow White and the Seven Dwarfs.",
    "I wouldn't buy anything with velcro. It's a total rip-off.",
    "Today I decided to go visit my childhood home. I asked the residents if I could come inside because I was feeling nostalgic, but they refused and slammed the door on my face. My parents are the worst.",
    "I can't take my dog to the pond anymore because the ducks keep attacking him. That's what I get for buying a pure bread dog.",
    "\"Did you get your haircut?\" No, I got them all cut.",
    "A man found a magic lamp with a genie that offered him three wishes. The man said, “For my first wish, I’d like to be rich.” “Okay, Rich,” said the genie. “What would you like for your second wish?”",
    "When the grocery store checker asks me if I want my milk in a bag, I say no, I’d rather keep it in the carton.",
    "I have a scary joke about math, but I'm 2² to say it.",
    "Why was the broom late? It over-swept.",
    "What's 90 degrees but covered with ice? The North and South Poles.",
    "What type of music do the planets enjoy? Neptunes.",
    "\"Your wife and daughter look like twins,\" my friend said. \"Well,\" I replied, \"they were separated at birth.\"",
    "What do you call a cow with no legs? Ground beef.",
    "Why was the stadium so hot after the game? Because all the fans left.",
    "Did you hear about the guy that evaporated? He'll be mist.",
    "Why was the math book sad? It had too many problems.",
    "I built a model of Mount Everest and my son asked, “Is it to scale?” I replied, “No… It’s to look at”",
    "MIlk is the fastest liquid on earth. It's pasterized before you even see it!",
    "Why did Waldo go to therapy? To find himself.",
    "How do flat-earthers travel? On a plane.",
    "A father tells his son that he was adopted. “I want to meet my biological parents,” the son demands. “We are your biological parents,” the father responds. “Now pack up, the new ones will pick you up in twenty minutes.”",
    "Did you hear about the girl who quit her job at the doughnut factory? She was fed up with the hole business.",
    "How do you fix a broken tomato? With tomato paste.",
    "I was going to go on an expensive vacation with a classical pianist, but he was too baroque.",
    "What do you call a moose with no name? Anonymoose.",
    "I have a joke about trickle-down economics, but 99% of you will never get it.",
    "I ate a clock the other day. It was very time consuming.",
    "Did you hear about the kidnapping at school. It's ok he woke up.",
    "My neighbor got sued for a fire his grill started. He filed for an appeal when he lost and it ended up in a pellet court.",
    "I have a joke about hunting for fossils, but you probably wouldn’t dig it.",
    "Give a man a plane ticket and he flies for the day. Push him out of the plane at 3,000 feet and he’ll fly for the rest of his life.",
    "Stop looking for the perfect match; use a lighter.",
    "Why is no one friends with Dracula? He's a pain in the neck.",
    "What do you call a cow with a twitch? Beef Jerky.",
    "Someone complimented my parking today! They left a sweet note on my windshield that said “parking fine.”",
    "I would avoid the sushi if I was you. It’s a little fishy.",
    "I went to a smoke shop only to discover it’d been replaced by an apparel store.",
    "I had a joke about canned juice, but I couldn't concentrate.",
    "I gave away all my used batteries today. Free of charge!",
    "How do trees get on the internet? They log in.",
    "My kid gave me a 'World's Best Dad' mug. At least she inherited my sense of humor.",
    "I was once a personal trainer, until I gave a too-weak notice.",
    "My friend said that if he went off a cliff, it would be on his own accord. It’s a good thing he drives a Civic.",
    "What kind of cars do eggs drive? Yolkswagens.",
    "What do you call cheese that isn't yours? Nacho Cheese.",
    "You can't spell par entry without \"try.\"",
    "I don't trust stairs because they're always up to something.",
    "What do lawyers wear to work? Law suits.",
    "Why can’t a leopard hide? Because he’s always spotted.",
    "I went to the zoo and saw a baguette in a cage. The zookeeper said it was bread in captivity.",
    "When I die, I want to be cremated. It’s my last chance to have a smokin’ hot body.",
    "What does a painter do when he gets cold? Puts on another coat.",
    "When does a joke become a dad joke? When it becomes apparent.",
    "\"I'll call you later.\" Don't call me later, call me Dad.",
    "Which friends do you always bring to dinner? Your taste buds.",
    "I'm thinking I should do lunges to stay in shape. That would be a big step forward.",
    "What's brown and sticky? A stick.",
    "Did you hear the one about the claustrophobic astronaut? He just needed a little space.",
    "Why did the thief take a shower before robbing the bank? He wanted to make a clean getaway.",
    "“Singing in the shower is fun until you get soap in your mouth. Then it’s a soap opera.”",
    "Why can’t you trust a balloon? It’s full of hot air",
    "What happens when doctors get frustrated? They lose their patients.",
    "What did the pecan say to the walnut it was chasing? I’ll cashew eventually!",
    "What happened to the lost beef shipment? Nobody's herd.",
    "I have a joke about a broken clock, but it’s not the right time.",
    "Where do you learn all about ice cream? Sundae school.",
    "I failed my driving test today. The instructor asked me, “What do you do at a red light?” I said, “I usually check my emails and see what people are up to on Facebook.”",
    "As I handed my Dad his 50th birthday card, he looked at me with tears in his eyes and said, “You know one would have been enough.”",
    "What has four wheels and flies? A garbage truck.",
    "She said I won’t be able to make it.",
    "What did one plate say to another plate? Tonight, dinner's on me.",
    "What did the police officer say to the belly button? You're under a vest!",
    "What kind of magic do cows believe in? Moodoo!",
    "Time flies like an arrow. Fruit flies like a banana…",
    "What do you call a cow with two legs? Lean beef.",
    "What do cows like to read? Cattle-logs.",
    "They say that 3/2 people are bad at fractions.",
    "When my uncle Frank died, he wanted his remains to be buried in his favorite beer mug. His last wish was to be Frank in Stein.",
    "Justice is a dish best served cold. If it were served warm, it would be just-water.",
    "Whenever the cashier at the grocery store asks my dad if he would like the milk in a bag he replies, \"No, just leave it in the carton!\"",
    "When my wife told me to stop impersonating a flamingo, I had to put my foot down…",
    "If a pig loses its voice…does it become disgruntled?",
    "When does a joke become a dad joke? When it becomes apparent!",
    "Two peanuts went walking down the street. One was assaulted.",
    "Time flies like an arrow. Fruit flies like a banana.",
    "Why do bananas wear sunscreen? Because they peel.",
    "Did you hear about the guy who had his left side cut off? He's all right now!",
    "I want to name my puppies Rolex and Timex so I can have watch dogs.",
    "Why don’t scientists trust atoms? Because they make up everything.",
    "Why do bees have sticky hair? Because they use honey combs.",
    "Why can't the sailor learn the alphabet? Because he kept getting lost at C.",
    "What do you call a man with a rubber toe? Roberto.",
    "Did you know that the first french fries weren’t cooked in France? They were cooked in Greece.",
    "Did I tell you the time I fell in love during a backflip? I was heels over head.",
    "What’s Forrest Gump’s password? 1forrest1.",
    "Why did the poodle buy a clock? It wanted to be a watch dog.",
    "What did the ocean say to the beach? Nothing. It just waved.",
    "“My extra winter weight is finally gone. Now, I have spring rolls.”",
    "I'm reading an anti-gravity book, and I just can't put it down!",
    "What did one piece of tape say to the other? Let’s stick together.",
    "If two vegetarians get in an argument, is it still called beef?",
    "What did the caretaker say when they jumped out of the store cupboard? “Supplies!”",
    "Two cannibals are eating a clown. One says to the other: “Does this taste funny to you?”",
    "To the man in the wheelchair that stole my camouflage jacket... You can hide but you can't run.",
    "When is a car not a car? When it turns into a driveway!",
    "My wife screamed \"you haven't listened to a single word I've said, have you?!\" What a weird way to start a conversation...",
    "What did the 0 say to the 8? Nice belt!",
    "My wife left me because of my obsession with pasta. I'm feeling cannelloni right now.",
    "I went to a really emotional wedding last week, even the cake was in tiers!",
    "What’s worse than biting into an apple and finding a worm? Biting into an apple and finding half a worm.",
    "I tried to start a professional hide and seek team, but it didn't work out. Turns out, good players are hard to find.",
    "During quarantine no one got my humor. I guess it was all the inside jokes.",
    "What did the cannibal choose as his last meal? Five Guys.",
    "What happens when frogs park illegally? They get toad.",
    "How many telemarketers does it take to change a light bulb? Only one, but he has to do it during dinner.",
    "Did you hear about the kidnapping at school? It's fine, he woke up.",
    "My therapist told me I have problems expressing my emotions. Can’t say I’m surprised.",
    "RIP, boiling water. You will be mist.",
    "What do you call a line of men waiting to get haircuts? A barberqueue.",
    "In America, using the metric system can get you in legal trouble.",
    "Why did the man fall down the well? Because he couldn't see that well!",
    "How fast is milk? It’s pasteurized before you know it.",
    "Two cannibals are eating a clown. One says to the other 'Does this taste funny to you?",
    "What did the buffalo say to his son when he dropped him off at school? “Bison!”",
    "What’s orange and sounds like a parrot? A carrot.",
    "How do you make 7 even? You take away the s.",
    "An invisible man married and invisable women. The kids were nothing to look at.",
    "My cat was just sick on the carpet. I don't think he's feline well.",
    "What genre are national anthems? Country.",
    "I got my best friend a fridge for his birthday. I can’t wait to see his face light up when he opens it!",
    "What happened to the dating slices of bread that disappeared overnight? Turns out they e-loafed! I hope they grow mold together.",
    "I’m friends with almost all the letters of the alphabet. I just don’t know Y.",
    "I told my doctor I heard buzzing, but she said it's just a bug that's going around.",
    "What do you call an alligator in a vest? An investigator.",
    "A man walks into a bar. The bartender asks, \"What do you want?\" The man says, \"Oh, just some fruit punch.\" The bartender sighs and shakes his head, \"If you want punch, you're gonna have to wait in line.\" The man looks around, but there is no punchline.",
    "Of all the inventions of the last 100 years, the dry erase board has to be the most remarkable.",
    "“Just look at that couple down the road,” a wife told her husband. “He keeps holding her hand, kissing her, holding the door for her. Why can’t you do that?” “Are you insane?” he responded. “I barely know the woman!”",
    "“What comes once in a minute, twice in a moment but never in a thousand years? The letter M.”",
    "One friend complained to another, “All my husband and I do anymore is fight. I've been so upset, I’ve lost 20 pounds.” “If it’s that bad, why don’t you just leave him?” asked the second friend. “I’d like to lose another fifteen pounds first.”",
    "My wife told me that I twist everything she says to my advantage. I take that as a compliment.",
    "Why didn't the vampire attack Taylor Swift? She had bad blood.",
    "If money doesn’t grow on trees, then why do banks have branches?",
    "Why is it a bad idea to eat a clock? Because it's so time-consuming.",
    "Why can't a leopard hide? He's always spotted.",
    "Have you heard of a music group called Cellophane? They mainly wrap.",
    "Which is faster, hot or cold? Hot, because you can catch a cold.",
    "Why don’t seagulls fly over the bay? Because then they’d be bagels (bay gulls).",
    "What do you call a cow with no legs? Ground beef!",
    "To whoever stole my copy of Microsoft Office, I will find you. You have my Word!",
    "Why did the scarecrow win an award? He was outstanding in his field.",
    "What did the sink tell the toilet? “You look flushed.”",
    "Why do you never see elephants hiding in trees? Because they’re so good at it!",
    "My wife said, “You weren’t even listening, were you?” And I thought, “that’s a pretty weird way to start a conversation.”",
    "If prisoners could take their own mug shots…They’d be called cellfies.",
    "I failed my calculus exam because I was sitting in the middle of identical twins — I couldn’t differentiate between them.",
    "I have a joke about being a rejected organ donor, but I just don't have the guts.",
    "What do you call a group of killer whales playing instruments? An Orca-stra!",
    "How do you stop a bull from charging? You cancel its credit card.",
    "Why are pediatricians always so angry? Because they have little patients.",
    "I bought some shoes from a drug dealer. I don't know what he laced them with, but I was tripping all day!",
    "What has five toes but isn't your foot? My foot.",
    "How do you talk to a giant? You use big words!",
    "Where did Napoleon keep his armies? Up his sleevies!",
    "What do you get when you cross an elephant and a fish? Swimming trunks.",
    "My hotel tried to charge me ten dollars extra for air conditioning. That wasn’t cool.",
    "What did the evil chicken lay? Deviled eggs.",
    "Where do you learn to make ice cream? Sundae school.",
    "I only seem to get sick on weekdays. I must have a weekend immune system.",
    "What do you call a herd of sheep falling down a hill? A lambslide.",
    "How do you make holy water? You boil the hell out of it.",
    "Dogs can’t operate MRI machines — but cats-can.",
    "I'm so good at sleeping that I do it with my eyes closed.",
    "Women should not have children after 36—really, 36 children is enough.",
    "How does cereal pay its bills? With Chex.",
    "What do you say to a rabbit on its birthday? Hoppy Birthday!",
    "Today I’m attaching a light to the ceiling, but I’m afraid I’ll probably screw it up.",
    "I wasn’t close to my father when he died. Which is lucky because he stepped on a landmine.",
    "6:30 is hands down the best time on the clock.",
    "Careful how many corny jokes you tell. Someone may just call the crops!",
    "Why do vampires always seem sick? They're coffin.",
    "Why did the picture go to jail? He was framed.",
    "I told my dad he had to quit smoking. When it came to his health we just couldn’t brisket.",
    "What’s green and has wheels? Grass. I lied about the wheels.",
    "A buddy asked how many fish I caught. I told him it’s not polite to fish and tell.",
    "Why did the ram run over the cliff? He didn’t see the ewe turn.",
    "What do you call two ducks and a cow? Quackers and milk.",
    "Getting paid to sleep would be my dream job.",
    "“What’s your name, son?” The principal asked his student. The kid replied, “D-d-d-dav-dav-david, sir.” “Do you have a stutter?” the principal asked. The student answered, “No sir, my dad has a stutter but the guy who registered my name was a real jerk.”",
    "The coach went to the bank to get his quarterback.",
    "You know people say they pick their noses… but I feel like I was just born with mine!",
    "I was sitting on the back porch with my wife when I suddenly blurted out, “I love you.” “Is that you or the beer talking?” she asked. I answered, “It’s me… talking to my beer.”",
    "I hate Velcro. It's a rip off.",
    "I could tell a joke about pizza, but it's a little cheesy.",
    "Who were the greenest Presidents in US history? The bushes.",
    "Do you know the most important job of a grill master at a restaurant? To please their steak holders.",
    "Did you hear about the hungry clock. It went back four seconds.",
    "How did the pirate get his ship for so cheap? It was on sail.",
    "What do you call a factory that makes okay products. A satisfactory.",
    "I talk to myself because sometimes I just need expert advice.",
    "I have a joke about kites, but it would just sail over your head.",
    "I have a joke about statistics, but it’s not significant.",
    "My wife asked me the other day where I got so much candy. I said, \"I always have a few Twix up my sleeve.\"",
    "Why did the whale blush? It saw the ocean’s bottom.",
    "Last night I had a dream I was a muffler. I woke up exhausted.",
    "I'm Buzz Aldrin, second man to step on the moon. Neil before me.",
    "Mom says I have no sense of direction, so I packed my bags and right.",
    "Why did the banana go to the doctor? Because it wasn’t peeling well.",
    "Did you hear the one about the roof? Never mind, it's over your head.",
    "What sort of room has no windows or doors? A mushroom!",
    "Every time I take my dog to the park, the ducks try to bite him. That’s what I get for buying a pure bread dog.",
    "What did the proton say to the electron? Stop being so negative all the time!",
    "What do you call a Frenchman wearing sandals? Philippe Flop.",
    "How do cows stay up to date? They read the Moo-spaper.",
    "What does an evil hen lay? Deviled eggs.",
    "Yesterday I accidentally swallowed some food colouring. The doctor says i'm ok, but i feel like i've dyed a little inside.",
    "Did you heard about the giant that threw up? It's all over town!",
    "What did the pepperoni say walking out of the hospital? I’m cured!",
    "Five out of four people admit they’re bad at fractions.",
    "Why did the employee get fired from the keyboard factory? He wasn’t putting in enough shifts.",
    "My friend was showing me his tool shed and pointed to a ladder. “That's my stepladder,” he said. \"I never knew my real ladder.”",
    "Where did the cat go after losing its tail? The retail store.",
    "Why did the duck fall on the sidewalk? He tripped on a quack.",
    "What does a house wear? Address! (A dress)",
    "Why do hamburgers go south for the winter? So they don’t freeze their buns.",
    "How do you deal with a fear of speed bumps? You slowly get over it.",
    "Dad, did you get a haircut? No, I got all of them cut.",
    "What did the ocean say to the beach? Nothing, it just waved.",
    "I just paid $100 for a belt that doesn’t fit — what a huge waist!",
    "I have a joke about chemistry, but I don’t think it’ll get a reaction.",
    "What kind of car does a sheep like to drive? A lamborghini.",
    "My wife and I laugh at how competitive we are. But I laugh more.",
    "I have a joke about time travel, but you guys didn’t get it.",
    "Which bear is the most condescending? A pan-duh.",
    "I always knock on the fridge door before opening it, just in case there's a salad dressing.",
    "What did one plate whisper to the other plate? Dinner is on me.",
    "The wedding was so beautiful, even the cake was in tiers.",
    "Am I the only man my wife has ever dated? Unfortunately yes, she said the others were all nines or tens!",
    "Why did police arrest the turkey? They suspected fowl play.",
    "Why should you never brush your teeth with your left hand? Because a toothbrush works better.",
    "Why did the scarecrow get an award? Because he was out standing in his field.",
    "Can anyone tell me what oblivious means, because I have no idea.",
    "What's the best thing about Switzerland? I don't know, but the flag is a big plus.",
    "What did one elevator say to the other elevator? I think I’m coming down with something.",
    "One of my friends and I just get together to eat hot dogs and tell the honest truth. It’s a frank relationship.",
    "I didn't want to believe that my dad was stealing from his job as a traffic cop, but when I got home, all the signs were there.",
    "What kind of noise does a witch’s vehicle make? Brrrroooom, brrroooom.",
    "My doctor told me I was going deaf. The news was hard for me to hear.",
    "Why don't skeletons ever go trick or treating? Because they have no body to go with.",
    "Yogurt is the most high class dairy product to buy. It’s so cultured.",
    "When I was a kid, my mother told me I could be anyone I wanted to be. Turns out, identity theft is a crime.",
    "Where do pirates get their hooks? Second hand stores.",
    "Why did the golfer bring two pairs of pants? Just in case he got a hole in one.",
    "What do you call a beehive without an exit? Unbelievable.",
    "Yesterday, I was washing the car with my son. He said, “Dad, can’t you just use a sponge?”",
    "Son: Dad, have you seen my sunglasses? Dad: No, have you seen my dad glasses?",
    "What kind of bird works on a construction site? A crane.",
    "Why did the Oreo go to the dentist? It lost its filling.",
    "Why did the coach go to the bank? To get his quarter back.",
    "Why did the little strawberry cry? His mom was in a jam.",
    "Did you know the first French fries weren't actually cooked in France? They were cooked in Greece.",
    "I hate my job—all I do is crush cans all day. It’s soda pressing.",
    "I fear for the calendar. It's days are numbered.",
    "What's a foot long and slippery? A slipper.",
    "I finally watched that documentary on clocks. It was about time.",
    "What do you call a bundle of hay in a church? Christian Bale.",
    "All vampires keep their money in a special place—the blood bank.",
    "My sister-in-law is an archaeologist. Only person I’ve known that is excited to find a bone in her chicken.",
    "What did the seal with one fin say to the shark? If seal is broken, do not consume.",
    "I don't get why bakers aren't wealthier. They make so much dough.",
    "My wife and I have decided not to have kids. The kids are taking it pretty badly.",
    "What kind of milk comes from a pampered cow? Spoiled milk.",
    "If you're feeling depressed, try drinking a gallon of water before you go to sleep. It'll give you a reason to get out of bed in the morning.",
    "What do you call a beehive without an exit? Un-bee-lievable.",
    "Lance isn't that common a name these days, but in medieval times, they were called lance-a-lot.",
    "What vegetable is cool, but not that cool? Radish.",
    "Have you heard about the restaurant on the moon? Great food, no atmosphere.",
    "Why are butter jokes so hard to make? Because there is no margarine for error.",
    "Have you heard of the new sport called Quiet Tennis”? It’s like normal tennis but without the racket.",
    "How does the moon cut his hair? Eclipse it.",
    "A red and blue ship have collided in the Carribean sea. Apparently the suvivors are marooned.",
    "Why are fish so smart? They live in schools!",
    "My son screeched, \"Daaaaaad, you haven't listened to one word I've said, have you!?\" What a strange way to start a conversation with me...",
    "What kind of fruit do ghosts like? Boo-berries.",
    "What days are the strongest? Saturday and Sunday. The rest are week (weak) days!",
    "Why was the football stadium cold? There were too many fans.",
    "The pony couldn't sing because it was a little horse.",
    "I just got my doctor's test results and I’m really upset. Turns out, I’m not gonna be a doctor.",
    "What do you call a penguin in the White House? Lost.",
    "Did the hear about the ice cream truck accident? It crashed on a rocky road.",
    "Which state has the most streets? Rhode Island.",
    "Two hats were hanging on a hat rack. One said 'You stay here, i'll go on a head'.",
    "In the beef army there was a soldier who always snuck up on the enemy from the left or right. He was a flank steak.",
    "Why'd the fisherman order the halibut? Just for the halibut!",
    "What did one leaf say to the other? I’m falling for you.",
    "My wife said my two biggest faults are I don’t listen and something else.",
    "What time do ducks wake up? At the quack of dawn.",
    "What lies at the bottom of the ocean and twitches? A nervous wreck.",
    "Did you hear about the walnut and cashew that threw a party? It was nuts.",
    "My wife left a note on the fridge that said, “This isn't working.” I’m not sure what she’s talking about. I opened the fridge door and it’s working fine!",
    "Why was the broom late to class? It over-swept.",
    "I dreamt about drowing in an ocean made of orange soda last night. It took me a while to work out it was just a Fanta Sea.",
    "How does a lawyer say goodbye? I'll be suing ya!",
    "Wanna hear a joke about construction? I'm still workin' on it!",
    "Why does a chicken coop only have two doors? Because if it had four doors it would be a chicken sedan!",
    "I have an inferiority complex, but it’s not a very good one.",
    "How do you make a water bed bouncier? Add spring water.",
    "A ship carrying red paint and a ship carrying blue paint collide in the middle of the ocean. Both crews were marooned.",
    "What did one wall say to the other? I’ll meet you at the corner.",
    "I'd tell you a chemistry joke but I know i wouldn't get a reaction.",
    "How come the Hulk doesn't lose his pants when he transforms? The experiment altered his jeans.",
    "My grief counselor died the other day. He was so good at his job, I don’t even care.",
    "What did one monocle say to the other monocle? Let's get together and make a spectacle of ourselves.",
    "To the person stole my laptop with my copy of Microsoft Office on it: I will find you. You have my Word!",
    "I just found out I’m colorblind. The news came out of the purple!",
    "My wife wanted to spice up our sex life, so she asked if we could play doctor tonight. It seemed like a weird idea, but I’m eager to please.",
    "What does a nosey pepper do? It gets jalapeño business.",
    "Did you hear about the scientist who was lab partners with a pot of boiling water? He had a very esteemed colleague. ",
    "Why don’t they play poker in the jungle? Too many cheetahs.",
    "Why do seagulls fly over the sea? If they flew over the bay, they would be bagels.",
    "I have a joke about a roof, but it would just go over your head.",
    "Why did the picture go to prison? Because it was framed.",
    "I ordered a chicken and an egg from Amazon. I'll let you know.",
    "What kind of jewelry do rabbits wear? 14 carrot gold.",
    "I used to hate facial hair, but then it grew on me.",
    "Where do dads store their dad jokes? In the dad-a-base.",
    "What do you call birds that stick together? Velcrows",
    "I had a date last night. It was perfect. Tomorrow, I’ll have a grape.",
    "Why are fish so easy to weigh? Because they have their own set of scales.",
    "A steak pun is a rare medium well done.",
    "They say that breakfast is the most important meal of the day. Well, not if it’s poisoned. Then the antidote becomes the most important.",
    "As I get older, I remember all the people I lost along the way. Maybe a career as a tour guide was not the right choice.",
    "You can't trust atoms. They make up everything!",
    "What did Yoda say when he saw himself in 4K? HDMI.",
    "Why did the snowman buy a bag of carrots? He wanted to pick his nose.",
    "Just got back from a job interview where I was asked if I could perform under pressure. I said I wasn’t too sure about that but I could do a wicked “Bohemian Rhapsody.”",
    "I only know 25 letters of the alphabet—I don't know y.",
    "A magician was walking down the street — then he turned into a store.",
    "A guy walked into a bar, and lost the limbo contest.",
    "“Whoever stole my depression medication — I hope you’re happy now.”",
    "Just finished cleaning my grill. It was grate.",
    "What's the difference between the bird flu and the swine flu? One requires tweetment and the other an oinkment.",
    "My uncle named his dogs Rolex and Timex. They’re his watch dogs!",
    "Why did the golfer bring two pairs of pants? In case he got a hole in one.",
    "How does a penguin build it's house? Igloos it together.",
    "Did you hear about the kidnapping at school? He woke up.",
    "What do you get if you cross an angry sheep with a moody cow? An animal that’s in a baaaaad mooood.",
    "What's a ninja's favorite type of shoes? Sneakers!",
    "How do you stop a bull from charging? Cancel its credit card.",
    "A cheese factory exploded in France. Da brie is everywhere!",
    "To the person who stole my place in line: I’m after you now.",
    "Where do armies belong? In your sleeves.",
    "This ham sandwich walks into a bar and orders a drink. The bartender says, “Sorry, we don’t serve food here.”",
    "I was wondering why this frisbee kept looking bigger and bigger. Then it hit me.",
    "Why is it so cheap to throw a party at a haunted house? Because the ghosts bring all the boos.",
    "People in Athens rarely get up before sunrise. Dawn is tough on Greece.",
    "Why did the cookie go to the doctor? It was feeling crumby.",
    "After dinner my wife asked if I could clear the table. I needed a running start, but I made it.",
    "I hate it when people say age is only a number. Age is clearly a word.",
    "What’s the difference between a dad and a grill? A grill runs out out of gas.",
    "I don't trust stairs. They're always up to something.",
    "Most people can’t tell the difference between entomology and etymology. I can’t find the words for how much this bugs me.",
    "What do you call a pig that does karate? A pork chop!",
    "What sound does a witches car make? Broom Broom",
    "Did you hear the rumor about butter? Well, I’m not going to go spreading it!",
    "Shouldn’t the “roof” of your mouth actually be called the ceiling?",
    "Why did the football coach go to the bank? To get his quarter back.",
    "How do you get a mouse to smile? Say “cheese.”",
    "My kid is blaming me for ruining their birthday. That's ridiculous, I didn't even know it was today!",
    "I’ve never gone to a gun range before. I decided to give it a shot!",
    "What's the difference between a man's wallet before and after kids? There are pictures where the money used to be.",
    "I’m addicted to collecting vintage Beatles albums. I need Help.",
    "What did one hat say to the other? You go on ahead.",
    "Does anyone need an ark? I Noah guy!",
    "What did the fish say when it swam into a wall? Damn!",
    "How do you follow Will Smith in the Mud? Follow the fresh prints.",
    "My dog has no nose. How does it smell? Awful!",
    "How do nonbinary people hurt each other? They slash them. (They/them)",
    "I'm reading a book about anti-gravity. It's impossible to put down!",
    "I ordered a chicken and an egg online. I’ll let you know what comes first.",
    "What has one horn and gives milk? A milk truck.",
    "What did the Dalmatian say after dinner? That hit the spot.",
    "What do you call a wizard who's really bad at football? Fumbledore.",
    "If I ever find the doctor who screwed up my limb replacement surgery…I’ll kill him with my bear hands.",
    "What did the janitor say when he jumped out the closet? “Supplies!”",
    "Do you know how many people are dead at a cemetery? All of them.",
    "What do you call a kangaroo’s lazy joey? A pouch potato.",
    "If a child refuses to nap, are they guilty of resisting a rest?",
    "What kind of magazines do cows read? Cattlelogs!",
    "I have a joke about butter, but I’m not going to spread it.",
    "Why did the watch go on vacation? To unwind.",
    "When does it rain money? When there is a change in the weather.",
    "Two goldfish are in a tank. One says to the other, \"do you know how to drive this thing?\"",
    "Why did the tailor get fired? He wasn’t a good fit.",
    "Dad, can you put the cat out? I didn't know it was on fire.",
    "Do you think glass coffins will be a success? Remains to be seen.",
    "I only know 25 letters of the alphabet. I don’t know y.",
    "What did the shy pebble wish for? That he was a little boulder.",
    "I have a joke about a broken pencil, but it’s pointless.",
    "What do you call a sheep that knows karate? A lamb chop.",
    "What do you call a happy cowboy? A jolly rancher.",
    "What do you call a factory that makes OK products? A satisfactory.",
    "Imagine if you walked into a bar and there was a long line of people waiting to take a swing at you. That’s the punch line.",
    "What’s that Nevada city where all the dentists visit? Floss Vegas.",
    "A kid decided to burn his house down. His dad watched, tears in his eyes. He put his arm around the mom and said, “That’s arson.”",
    "What did the drummer call his twin daughters? Anna one, Anna two!",
    "What does a dad get in their stocking if they’ve been naughty? Char-coal.",
    "Why didn’t the sun go to college? It already had a million degrees.",
    "Without geometry life is pointless.",
    "Why are fish so smart? Because they swim in schools.",
    "Where do polar bears keep their money? The snow bank.",
    "What do you call a fly without wings? A walk.",
    "During my calculus test, I had to sit between identical twins. It was hard to differentiate between them.",
    "What do you call a sleeping bull? A bulldozer.",
    "I have a joke about the flu, but I hope you don’t get it.",
    "I was excited to hear Apple might start selling its own cars until I learned they wouldn’t support windows.",
    "I love dad jokes, but I don't have kids, which makes me a Faux Pa.",
    "To whoever stole my copy of Microsoft Office, I will find you. You have my Word.",
    "What gets wetter the more it dries? A towel.",
    "What did the two pieces of bread say on their wedding day? It was loaf at first sight.",
    "“I got fired from my job as a taxi driver. It turns out nobody thought I was fare.”",
    "If you donate a kidney, everybody loves you and you’re a total hero. But try donating five kidneys and suddenly everyone is yelling and the police get called.",
    "When does a joke turn into a dad joke? When it becomes apparent.",
    "The difference between a numerator and a denominator is a short line. Only a fraction of people will understand this.",
    "What should you do if you meet a giant? Use big words.",
    "How do frogs invest their money? They use a stock croaker.",
    "What kind of music scares balloons? Pop music.",
    "What do you call a fly with a sore throat? A hoarse fly.",
    "It was an emotional wedding — even the cake was in tiers.",
    "What has ears but cannot hear? A cornfield!",
    "I like to spend my weekends playing chess with elderly men in the park. But it’s becoming more difficult. You try finding exactly32 old guys.",
    "What do you call a fake noodle? An impasta.",
    "This year’s Fibonacci convention is going to be really special. Apparently it’s as big as the last two put together.",
    "Why do peppers make such good archers? Because they habanero.",
    "What did the buffalo say to its son when he left? Bison!",
    "Atheism is a non-prophet organization.",
    "I thought about going on an all-almond diet. But that's just nuts.",
    "Why did the scarecrow win an award? Because he was outstanding in his field",
    "My landlord told me we need to talk about the heating bill. \"Sure,\" I said. \"My door is always open.\"",
    "What do you call recently-married spiders? Newly-webs.",
    "Why did the scarecrow win an award? Because he was outstanding in his field!",
    "What's black and white and goes around and around? A penguin in a revolving door.",
    "What does a nosey pepper do? It gets jalapeno business!",
    "Wanna hear a joke about paper? Never mind. It's tearable.",
    "What do you call two monkeys who share an Amazon Prime account? Prime mates.",
    "Did you hear about the cantaloupe that went to a therapist? I guess it was feeling Meloncholy.",
    "What does the stork do once he's delivered the baby? He lies on the couch and drinks a beer!",
    "How does Darth Vader like his bagels? On the dark side.",
    "Why shouldn't you tell an egg a joke? It'll crack up.",
    "My wife is really mad at the fact that I have no sense of direction. So I packed up my stuff and right.",
    "I remember the first time I saw a universal remote control. I thought to myself 'well this changes everything'.",
    "I asked my dog what's two minus two. He said nothing.",
    "Why are pigs so bad at sports? They always hog the ball.",
    "Where do boats go when they're sick? To the dock.",
    "What’s the best air to breathe if you want to be rich? Millionaire.",
    "I have a few jokes about retired people, but none of them work.",
    "I asked my wife if I was the only one she slept with. She said yes—the others were 7’s and 8’s.",
    "What's the advantage of living in Switzerland? Well, the flag is a big plus!",
    "Last night my wife and I watched two DVDs back to back. Luckily I was the one facing the TV.",
    "To the person who stole my depression medication: I hope you're happy now.",
    "My wife asked why I didn’t buy her flowers. To be fair, I didn’t know she sold flowers.",
    "I just applied for a job down at the diner. I told them I really bring a lot to the table.",
    "Why didn't the skeleton cross the road? Because he had no guts!",
    "I wasn't going to get a brain transplant. But then I changed my mind.",
    "I was wondering why the frisbee kept getting bigger and bigger. Then it hit me.",
    "An apple a day keeps the doctor away. At least it does if you throw it hard enough.",
    "I'd avoid the sushi if I were you — it's a little fishy!",
    "What key is used to open bananas? A mon-key.",
    "I was wondering why the baseball kept getting bigger and bigger. Then it hit me.",
    "Why did the nose feel sad? It was always getting picked on.",
    "Where do books hide when they’re afraid? Under their covers.",
    "What do you call cheese that isn't yours? Nacho cheese.",
    "I wish my gray hair started in Las Vegas because what happens in Vegas, stays in Vegas.",
    "Did you hear about the king that went to the dentist? He needed to get crowns.",
    "Did you know the first French fries weren’t really cooked in France? They were cooked in Grease! (Greece)",
    "Why did the man put his money in the freezer? He wanted cold, hard cash.",
    "There’s a disease that makes you uncontrollably tell airport jokes. No cure… it’s terminal.",
    "Why was the belt sent to jail? For holding up a pair of pants!",
    "I don’t get why Marvel doesn’t use the Hulk to advertise more. He’s basically one big Banner.",
    "I have a great joke about nepotism. But I’ll only tell it to my kids.",
    "Why did the orange lose the race? It ran out of juice.",
    "What happens when a snowman throws a tantrum? He has a meltdown.",
    "In 2017 I didn't do a marathon. I didn't do one in 2018, 2019, or 2020, either. This is a running joke.",
    " A Central European trampolining team has recently gone bankrupt. They were bouncing Czechs.",
    "What do computers eat for a snack? Microchips.",
    "What did the banana say to the boy? Nothing, bananas can't talk!",
    "What do you call a seagull that flies over the bay? A bagel",
    "What do you call a line you wait in to buy a grill? A Barbe-Queue.",
    "Did you hear about the cold dinner? It was chili.",
    "I hated facial hair but then it grew on me.",
    "Where do you take someone who’s been injured in a peak-a-boo accident? To the I-C-U.",
    "Why did the man get fired from the banana factory? He kept throwing away the bent ones.",
    "What do you get when you cross a Smurf and a cow? Blue cheese.",
    "How do you make a tissue dance? Put a little boogie in it!",
    "Which days are the strongest? Saturday and Sunday. The rest are weekdays.",
    "Do you know the last thing my grandfather said to me before he kicked the bucket? “Grandson, watch how far I can kick this bucket.”",
    "I just read that someone in London gets stabbed every 52 seconds. Poor bastard.",
    "5/4 of people admit that they’re bad with fractions.",
    "What kind of music should you listen to while fishing? Something catchy!",
    "Can I watch TV? Yes but don't turn it on.",
    "Why did the girl toss a clock out the window? She wanted to see time fly.",
    "How many apples grow on a tree? All of them.",
    "What happens when you pinch a grape? It lets out a little whine.",
    "My wife gave birth three times and still fits in her prom dress from high school. I gave birth zero times and I don’t fit in my pants from March.",
    "I’m on a seafood diet. I see food and I eat it!",
    "I haven’t talked to my wife in a week — I didn’t want to interrupt her.",
    "I was reading a great book about an immortal dog the other day. It was impossible to put down.",
    "Why can’t you eat Wookie meat? Because it’s too chewy…",
    "Struggling to think of what to buy someone for Christmas? Get theme a fridge and watch their face light up when they open it.",
    "My toddler is refusing to nap. He’s guilty of resisting a rest.",
    "What do you call a toothless bear? A gummy bear!",
    "How do you make a tissue dance? You put a little boogie in it.",
    "What do you call an elephant that doesn't matter? An irrelephant.",
    "A man walks into a magic forest and tries to cut down a talking tree. “You can't cut me down,” the tree complains. “I’m a talking tree!” The man responds, “You may be a talking tree, but you will dialogue.”",
    "My parents raised me as an only child. Which really annoyed my younger brother.",
    "A witch's vehicle goes brrrroom brrrroom!",
    "What did the janitor say when he jumped out of the closet? Supplies!",
    "If you see a robbery at an Apple store, does that make you an iWitness?",
    "A panic-stricken man explained to his doctor, “You have to help me, I think I’m shrinking.” “Now settle down,” the doctor calmly told him. “You'll just have to learn to be a little patient.”",
    "How does a penguin build a house? Igloos it together.",
    "“I only know 25 letters of the alphabet. I don’t know y.”",
    "I have a joke about inferiority complexes, but it’s not very good.",
    "Where do elephants store luggage? In a trunk.",
    "What’s Forrest Gump’s password? 1forrest1",
    "“Today my son asked me, ‘Can I have a bookmark’? I burst into tears — he’s 12 years old and still doesn’t know my name!”",
    "Did you hear the story about the haunted lift? It really raised my spirits!",
    "Where do crayons go on vacation? Color-ado.",
    "What does a librarian use to go fishing? A bookworm.",
    "I asked the IT guy, \"How do you make a Motherboard?\" He said, \"I tell her about my job.\"",
    "You’re American when you go into the bathroom, and you’re American when you come out, but do you know what you are while you’re in there? European.",
    "I used to be able to play piano by ear, but now I have to use my hands.",
    "I used to be addicted to soap, but I’m clean now.",
    "How did the farmer fix his torn overalls? With a cabbage patch.",
    "I had an appointment to see my psychic next week, but she just called to cancel.",
    "“I can tolerate algebra, maybe even a little calculus, but geometry is where I draw the line.”",
    "Can I dive in this pool? It deep-ends.",
    "Can a kangaroo jump higher than the Empire State Building? Of course! Buildings can’t jump.",
    "I wanted my kids to watch the orchestra, but I had to turn it off—too much sax and violins.",
    "I built a model of Mount Everest and my son asked if it was to scale. \"No,\" I said. \"It's to look at.\"",
    "A slice of apple pie costs $2.50 in Jamaica and $3.00 in the Bahamas. These are the pie rates of the Caribbean.",
    "The guy who stole my diary just died. My thoughts are with his family.",
    "Two guys walked into a bar. The third guy ducked.",
    "I ordered a chicken and an egg online. I'll let you know.",
    "What's Forrest Gump's computer password? 1forrest1",
    "My boss told me to have a good day, so I went home!",
    "Where do math teachers go on vacation? Times Square.",
    "Why was the traffic light late to work? It took too long to change.",
    "What type of tree fits in your hand? A palm tree.",
    "What are the strongest days of the week? Saturday and Sunday. All the others are weekdays.",
    "Where do fish keep their money? In a river bank.",
    "Did you hear about the restaurant on the moon? Great food, no atmosphere.",
    "What do you call someone who can’t stick to a diet? A desserter.",
    "Did you hear about the restaurant on the moon? Great food, no atmosphere…",
    "Why are spiders so smart? They can find everything on the web.",
    "My boss asked me why I only get sick on work days. I said it must be my weekend immune system.",
    "What do you call a pencil with two erasers? Pointless.",
    "What's blue and not very heavy? Light blue.",
    "Why was 2019 afraid of 2020? Because they had a fight and 2021.",
    "What do you call a locomotive carrying bubble gum? A chew chew train.",
    "I have a joke about being an electrician, but it’s too shocking.",
    "Why do bees have sticky hair? Because they use a honeycomb.",
    "Mom said I should do lunges to stay in shape. That would be a big step forward.",
    "Mom is mad at me because she asked me to sync her phone, so I threw it in the ocean.",
    "How do you make an octopus laugh? With ten-tickles!",
    "What musical instrument do you find in the bathroom? A tuba toothpaste!",
    "Have you ever tried to eat a clock? It's very time consuming.",
    "A century ago, two brothers decided it was possible to fly. And as you can see, they were Wright.",
    "To the person who stole my diary and then died: My thoughts are with your family.",
    "Did you hear about the whale that swallowed a clown? It felt funny after.",
    "What do you call a fake noodle? An Impasta.",
    "My wife and I were out to dinner and the waitress started flirting with me. \"She obviously has COVID,\" my wife said. \"Why?\" I asked. \"Because she has no taste.\"",
    "I used to be addicted to the hokey pokey, but I turned myself around.",
    "What's a tornado's favorite game? Twister!",
    "To the person who stole my case of energy drinks: I bet you can't sleep at night.",
    "I love telling Dad jokes. Sometimes he even laughs.",
    "Mom asked me to put ketchup on the grocery list. Now I can't see anything.",
    "Ghosts are bad liars because you can see right through them.",
    "I asked my date to meet me at the gym but she never showed up. I guess the two of us aren't going to work out.",
    "The shovel was a ground-breaking invention.",
    "What happens when ice cream gets angry? It has a meltdown.",
    "I just watched a program about beavers. It was the best dam program I've ever seen.",
    "What do you call a can opener that doesn’t work? A can’t opener!",
    "Did you hear about the outlet who got in a fight with the power cord? He thought he could socket to him.",
    "I asked my dog what’s two minus two. He said nothing.",
    "If a child refuses to sleep during nap time, are they guilty of resisting a rest?",
    "Why'd the alternate universe Spider-Man do so well on his driving test? He's an excellent parallel Parker.",
    "I used to work in a shoe recycling shop. It was sole destroying.",
    "Why are cats bad storytellers? Because they only have one tale.",
    "My dad was born a conjoined twin, but separated at birth. So I have an uncle, once removed.",
    "I have a joke about procrastination, but I’ll tell it to you later.",
    "This morning, Siri said, “Don’t call me Shirley.” I accidentally left my phone in Airplane mode.",
    "I have a joke about pizza, but it’s too cheesy.",
    "I just broke up with my mathematician girlfriend. She was obsessed with an X.",
    "I went to see the doctor about my blocked ear. “Which ear is it?” he asked. “2018,” I replied.",
    "How much money does a skunk have? Just one scent.",
    "Where do burgers go dancing? At the meatball.",
    "What do you call a Frenchman in sandals? Philippe Philoppe.",
    "What do lazy farmers grow? Couch potatoes!",
    "How you fix a broken pumpkin? With a pumpkin patch.",
    "Why couldn't the bicycle stand up by itself? It was two tired!",
    "What did the sink tell the toilet? You look flushed!",
    "Why do birds fly south? Because it’s too far to talk.",
    "I once saw a one-handed man in a second-hand store. I told him, “I don’t think they have what you’re looking for, sir.”",
    "What's Forrest Gump's password? 1forrest1",
    "Why was 6 afraid of 7? Because 7 ate nine!",
    "Me: “Go to bed, the cows are already asleep in the field.” Son: “So what?” Me: “It’s pasture bedtime.”",
    "I found a wooden shoe in my toilet today. It was clogged.",
    "Did you hear about the cartoonist found dead at his home? Details are sketchy.",
    "What do you give a sick lemon? Lemon-aid.",
    "I'm so good at sleeping that I can do it with my eyes closed!",
    "Dear Math, it's time to grow up and solve your own problems.",
    "I tried to make up a joke about ghost but I couldn't. It had plenty of spirit but no body.",
    "In fact, if you sneer at any other method of measuring liquids, you may be held in contempt of quart.",
    "Why do dads take an extra pair of socks when they play golf? In case they get a hole in one.",
    "A sandwich walks into a bar. The barman says: 'sorry we don't serve food here'",
    "If you’re up at night while the cows are asleep in the field that means it’s pasture bedtime.",
    "What does a zombie vegetarian eat? “GRRRAAAIINS!”",
    "Why did the computer get glasses? To improve its website.",
    "Does anybody know where a guy can find a person to hang out with, talk to, and enjoy spending time with? I'm just asking for a friend.",
    "It really takes guts to be an organ donor.",
    "I decided to sell the vacuum cleaner — it was just gathering dust!",
    "Where’s the one place you should never take your dog? A flea market.",
    "Why do cows have bells? Because their horns don’t work.",
    "My dad died because he couldn’t remember his blood type. He kept insisting we “be positive,” but it’s just so hard without him.",
    "Why do bakers work so hard? Because they knead dough.",
    "Why did the frog take the bus to work? His car got toad.",
    "What invention allows us to see through walls? Windows.",
    "Why are pigs bad drivers? They hog the road.",
    "There's a new type of broom in stores. It's sweeping the nation!",
    "What did the hamburger name its baby? Patty.",
    "What did the buffalo say to his son when he dropped him off at school? Bison.",
    "Why did the scarecrow win an award? Because he was outstanding in his field.",
    "What do you call someone who tells dad jokes but isn't a dad? A faux pa.",
    "How do you know when a bike is thinking? You can see its wheels turning.",
    "Try the seafood diet—you see food, then you eat it.",
    "“Did you hear that I’m reading a book about anti-gravity? It’s impossible to put down.”",
    "My dentist pulled out the wrong tooth. He said it was acci-dental.",
    "I had a dream that I weighed less than a thousandth of a gram. I was like, 0mg.",
    "I just don't trust stairs, they're always up to something.",
    "I haven't spoken to my wife in four years. I thought it would be rude to interrupt her!",
    "After an unsuccessful harvest, why did the farmer decide to try a career in music? Because he had a ton of sick beets.",
    "What did the fried rice say to the shrimp? Don't wok away from me. ",
    "How can you tell the difference between a dog and tree? By their bark.",
    "Why did the baseball player get arrested? He stole third base.",
    "I’m so good at sleeping, I can do it with my eyes closed!",
    "What’s the best thing about living in Switzerland? I don’t know, but the flag is a big plus.",
    "What do you give a scientist with bad breath? Experi-mints.",
    "How do you teach kids about taxes? Eat 38% of their ice cream.",
    "The first thing Santa's elves learn in school is their elf-abet.",
    "What do you call a bear with no teeth? A gummy bear.",
    "What did the calculator say to the pencil? You can count on me.",
    "What did the plumber say to the singer? Nice pipes.",
    "If you see a crime at an Apple store, are you an iWitness?",
    "Air used to be free at the gas station, now it costs 2.50. You want to know why? Inflation.",
    "What do you call a hippie's wife? Mississippi.",
    "The difference between a numerator and a denominator is a short line. Only a fraction of people will understand this",
    "“I saw a 1,000-year-old oil stain; it was from ancient Greece.”",
    "It's easy to convince ladies not to eat Tide Pods, but harder to deter gents.",
    "Why did the boy bring a ladder on the bus? He wanted to go to high school.",
    "How do astronomers organize a party? They planet.",
    "I went to buy a pair of camouflage pants, but I couldn’t find any.",
    "What does a baby computer call his father? Data.",
    "Did you hear the rumor about butter? Well, I'm not going to go spreading it!",
    "A furniture store keeps calling me. All I wanted was one night stand.",
    "What time did the man go to the dentist? Tooth hurt-y!",
    "What rock group has four men who don't sing? Mount Rushmore.",
    "Did you hear about the chameleon who couldn't change color? He had a reptile dysfunction.",
    "A cop started crying while he was writing me a ticket. I asked him why and he said, \"It's a moving violation.\"",
    "Why couldn’t the bike stand up on its own? It was too tired.",
    "Why can’t you trust an atom? Because they make up everything.",
    "What do you call a bear without any teeth? A gummy bear!",
    "How did the barber win the race? He knew a shortcut.",
    "What kind of tree fits in your hand? A palm tree.",
    "You can’t trust atoms. They make up everything!",
    "Why did the deer go to the dentist? It had buck teeth.",
    "Your mom and I let astrology get between us. It just Taurus apart.",
    "How do celebrities stay cool? They have many fans.",
    "A son tells his father, “I have an imaginary girlfriend.” The father sighs and says, “You know, you could do better.” “Thanks Dad,” the son says. “That means a lot.” The father shakes his head and goes, “I was talking to your girlfriend.”",
    "Where do you learn to make ice cream? At sundae school!",
    "What did the exasperated man serve at his barbecue? Sheesh kabobs.",
    "How do birds learn to fly? They wing it.",
    "RIP boiling water, you will be mist.",
    "What happened when the blue ship and the red ship collided at sea? Their crews were marooned.",
    "What do you call someone who refuses to fart in public? A private tutor.",
    "What kind of music do chiropractors like? Hip pop.",
    "What do you call a bear that is missing his ears? B.",
    "Not sure if you have noticed, but I love bad puns. That’s just how eye roll.",
    "What did the mountain climber name his son? Cliff",
    "What's E.T. short for? Because he's only got little legs!",
    "Not to brag but I made six figures last year. I was also named worst employee at the toy factory.",
    "I tried to get a smart car the other day but they sold out too fast. Why? I guess I'm just a bit slow.",
    "What did the llama say to his date? “Want to go on a picnic? Alpaca lunch.”",
    "How do you fix a pumpkin with a hole in it? With a pumpkin patch!",
    "What do you call a fancy fish? So-fish-ticated.",
    "I just found out Albert Einstein existed. My whole life I thought he was a theoretical physicist.A comma. A literalist takes everything literally. A kleptomaniac takes everything, literally.",
    "What do you call a fish with two knees? A tuna (two-knee) fish!",
    "I tell dad jokes but I have no kids. I’m a faux pa!",
    "Did you hear about the 12-inch dog? It was a foot long.",
    "Did you hear about the claustrophobic astronaut? He just wanted a bit more space.",
    "How do you throw a party in outer space? You planet.",
    "What state is known for its small drinks? Minnesota.",
    "How does the rancher keep track of his cattle? With a cow-culator.",
    "Every night, I have hard time remembering something, but then it dawns on me.",
    "Why were the utensils stuck together? They were spooning.",
    "I ordered a chicken and an egg from Amazon. I’ll let you know.",
    "What did the roof say to the shingle? The first one’s on the house.",
    "Within minutes the detectives knew what the murder weapon was. It was a brief case.",
    "What do you call a fish with two knees? A two-knee fish!",
    "I heard there is a new shop called Moderation. They have everything in there.",
    "How does a hurricane see? With one eye.",
    "To the person who stole my glasses: I will find you. I have contacts.",
    "Why can't your hand be 12 inches long? Because then it would be a foot.",
    "How do you find Will Smith in a snowstorm? You look for fresh prints.",
    "Anyone looking to buy a Delorean? Good shape, good mileage. Only driven from time to time",
    "What’s the difference between an African elephant and an Indian elephant? About 5,000 miles.",
    "What do astronauts eat for protein? Launch Meat.",
    "What kind of cereal do leprechauns eat? Lucky Charms.",
    "What sounds like a sneeze and is made of leather? A shoe.",
    "Son: Dad, can I watch the TV? Dad: Sure, just don’t turn it on.",
    "What’s an astronaut’s favorite part of the computer? The Space Bar.",
    "What do houses wear? An address.",
    "If April showers bring May flowers, what do May flowers bring? Pilgrims.",
    "Why did the Invisible Man turn down a job offer? He couldn’t see himself doing it.",
    "I just spent $300 on a limo and learned it doesn't come with a driver. I can't believe I have nothing to chauffer it.",
    "Spring is here! I got so excited that I wet my plants.",
    "I used to play piano by ear, but now I use my hands.",
    "What do you call a funny mountain? Hill-arious.",
    "What happened when the ten-year-old cannibal spilled his soup? His mother gave him an earful.",
    "What did the T-Rex use to cut wood? A dino-saw.",
    "I'm worried for the calendar because its days are numbered.",
    "Why did the phone wear glasses? Because it lost all its contacts.",
    "I think my wife is putting glue on my antique guns collection. She denies it but I'm sticking to my guns.",
    "I heard Sony’s coming out with a new console during the pandemic...It’s called the Plaguestation 5.",
    "I told him, “I think we’ll still be using mirrors in five years.”",
    "Clothes, but no cigar.",
    "I talked to a poet who only wrote about wells. His stuff was deep.",
    "30 percent of pet owners let their pets sleep in their bed. I tried it and my goldfish died.",
    "I have a joke about immortality, and it never gets old.",
    "Two sheep walk into a—baaaa.",
    "I stayed up all night wondering where the sun went. Then it dawned on me.",
    "I tried to explain to my 4-year-old son that it’s perfectly normal to accidentally poop your pants. But he’s still making fun of me.",
    "What do you call a man with a rubber toe? Roberto!",
    "I have a joke about drilling, but it’s boring.",
    "I have a joke about paper, but it’s tearable.",
    "What kind of shoes does a lazy person wear? Loafers.",
    "How do you measure the mass of an influencer's following? By Instagrams!",
    "What do you call a girl in the middle of a tennis court? Annette.",
    "What do you call two monkeys who share an Amazon account? Prime mates.",
    "What do you call bears with no ears? B.",
    "To the person who stole my bed: I won't rest until I find you.",
    "Why does a husband lead a dog's life? He comes in with muddy feet, gets comfortable by the fire, and waits to be fed.",
    "I’d like to have kids one day. I don’t think I could stand them any longer than that, though.",
    "Did you know your pupils are the last part to stop working when you die? They dilate.",
    "My wife told me she’ll slam my head on the keyboard if I don't get off the computer. I’m not too worried, I think she’s jokinlkjhfakljn m,.nbziyoao78yv87dfaoyuofaytdf",
    "What do you call a dinosaur with an extensive vocabulary? A thesaurus.",
    "What's a sea monster's favorite lunch? Fish and ships.",
    "What made the tomato blush? It saw the salad dressing.",
    "My friend couldn't afford to pay his bill, so I sent him a \"Get Well Soon\" card.",
    "What do dogs and phones have in common? Both have collar ID.",
    "How do you organize a space party? You planet.",
    "At first, I thought my chiropractor wasn’t any good, but now I stand corrected.",
    "Why do you never see elephants hiding in trees? Because they're so good at it.",
    "How do you get a farm girl to marry you? First, a tractor.",
    "You can tell it's a dogwood tree from its bark.",
    "I wanted to go on a diet, but I feel like I have way too much on my plate right now.",
    "What has five toes and isn't your foot? My foot.",
    "What do you put on a lonely grilled cheese sandwich? Provolone, but only if you have it’s parmesan.",
    "Concerned that his son was spending too much time on video games, a dad told him, “When Abe Lincoln was your age, he was studying books by the light of the fireplace.” “Oh yeah?” the son retorts. “Well, when Abe Lincoln was your age, he was President of the United States.”",
    "What is heavy forward but not backward? A ton.",
    "What do you call a man wearing a rug on his head? Matt.",
    "What’s the best kind of music to listen to when fishing? Something catchy.",
    "I once wrote a song about a tortilla, but it's more of a wrap.",
    "Why couldn't the bicycle stand up by itself? It was two tired.",
    "Never date a tennis player. Love means nothing to them.",
    "I'm reading an anti-gravity book. I can't put it down!",
    "I'm reading a horror story in braille. Something bad is going to happen, I can just feel it.",
    "What do you call spaghetti in disguise? An impasta.",
    "I wish my kids weren't offended by my Frozen jokes. They really need to let it go!",
    "Accidentally burned dinner on the grill. Mis-steaks were made.",
    "What brand of underwear do scientists wear? Kelvin Klein.",
    "It’s raining cats and dogs, so be careful not to step in a poodle.",
    "What's a lawyer's favorite drink? Subpoena colada.",
    "We’re renovating the house, and the first floor is going great, but the second floor is another story.",
    "I tell dad jokes, but I don't have any kids. I'm a faux pa.",
    "\"Cop: I'm arresting you for downloading the entire Wikipedia.\" Man: \"Wait! I can explain everything!\"",
    "Why don’t eggs tell jokes? They’d crack each other up.",
    "Why did the cowboy adopt a wiener dog? He wanted to get a long little doggy.",
    "I have a clean conscious—it's never been used.",
    "My daughter just shrieked at me, “Daaaaaad, you haven’t listened to a word I’ve said, have you?” What an odd way to begin a conversation.",
    "Marriage involves three rings: The engagement ring, the wedding ring, and the suffer-ring.",
    "What do you call a medieval lamp? A knight light.",
    "I used to be a banker, but I lost interest.",
    "Why should you never use a dull pencil? Because it’s pointless.",
    "How many clickbait articles does it take to change a lightbulb? The answer will shock you!",
    "My friend keeps saying \"cheer up man it could be worse, you could be stuck underground in a hole full of water.\" I know he means well.",
    "I was playing chess with my friend and he said, “Let’s make this interesting.” So we stopped playing chess.",
    "What do you call a potato wearing glasses? A spec-tater.",
    "What do you call a snake that loves building houses? A boa constructor.",
    "Why do melons have weddings? They cantaloupe!",
    "What do you call a baby monkey? A chimp off the old block.",
    "What do you call a pencil with two erasers? Pointless!",
    "I wanted to eat a watch for lunch, but it was too time-consuming.",
    "What kind of sandals do frogs wear? Open-toad.",
    "I used to run a dating service for chickens. But I was struggling to make hens meet.",
    "What’s the best kind of bird to work for a construction company? A crane.",
    "I wonder what my parents did to fight boredom before the internet. I asked my eighteen brothers and sisters but they didn’t have any idea either.",
    "Where does a sheep go to get a haircut? The baa baa shop.",
    "If the early bird gets the worm, I'll sleep in until there's pancakes.",
    "A rancher had only had 48 cows on his property, but when he rounded them up he had 50.",
    "What do a tick and the Eiffel Tower have in common? They’re both Paris sites.",
    "What do you call a fish with no eyes? A fsh.",
    "What is the difference between a literalist and a kleptomaniac?",
    "I’m thinking about removing my spine. I feel like it’s only holding me back.",
    "The past, present and future walked into a bar. It was tense.",
    "What do you call a fibbing cat? A lion.",
    "Why is Peter Pan always flying? Because he Neverlands.",
    "Our vacuum cleaner is getting old. It's just gathering dust.",
    "What has five toes and isn’t your foot? My foot.",
    "What’s more unbelievable than a talking dog? A spelling bee.",
    "What do you call a man who can’t stand? Neil.",
    "How do you spell “candy” with just two letters? C and Y.",
    "My wife gave me an ultimatum: Her or my addiction to sweets. The decision was a piece of cake.",
    "Why did the picture go to jail? Because it was framed.",
    "Why do nurses like red crayons? Sometimes they have to draw blood.",
    "A man is washing his car with his son. The son asks, “Can’t you just use a sponge?”",
    "Have you heard about the new corduroy pillows — they're making headlines!",
    "What did the late tomato say to the other tomatoes? Don't worry i'll ketchup.",
    "My wife said I ruined her birthday. I’m not sure how I did that, I didn’t even KNOW it was her birthday!",
    "When I see the names of lovers engraved on a tree, I don’t find it cute or romantic. I find it weird how many people take knives with them on dates.",
    "My dog is a genius. I asked him, \"What's two minus two?\" He said nothing.",
    "A doctor walks into a room with a dying patient and tells him, “I’m sorry, but you only have ten left.” The patient asks him, “Ten what, Doc? Hours? Days? Weeks?” The doctor calmly looks at him and says, “Nine.”",
    "I have a fish that can breakdance. Only for ten seconds though, and only once.",
    "What did the blanket say to the bed? I’ve got you covered.",
    "At the job interview, they asked me, “Where do you see yourself in five years?”",
    "“Just say NO to drugs!” Well, if I’m talking to drugs, I probably already said yes.",
    "What’s an astronaut’s favorite part of a computer? The space bar.",
    "In my free time, I like to help blind people. Verb, not adjective.",
    "What do you call a fish with no eyes? Fsh.",
    "What did the mama cow say to the baby cow? It’s pasture bed time.",
    "I catered a movie night where they watched titanic. Safe to say the iceberg lettuce wraps didn’t go over well.",
    "What’s a skeleton’s favorite dish at a BBQ? Ribs!",
    "People are making apocalypse joke like there is no tomorrow!",
    "What concert would cost only 45 cents? 50 Cent featuring Nickelback!",
    "Why did the coffee file a police report? It got mugged.",
    "What is the difference between an angry circus owner and a Roman barber? One is a raving showman, the other is a shaving roman.",
    "The secret service isn't allowed to yell \"Get down!\" anymore when the president is about to be attacked. Now they have to yell \"Donald Duck!\"",
    "“Siri,” I asked my phone, “why am I so bad with women?\" She responded, “I’m Bixby, you moron.”",
    "I had to sell my vacuum cleaner. All it was doing was gathering dust.",
    "Why did the tomato blush? It saw the salad dressing.",
    "What do you call a sad cup of coffee? Depresso.",
    "Why did the scarecrow win an award? It was outstanding in its field.",
    "Held a poker night where the buy in was a prime ribeye. I invited my brother but he said the steaks were too high.",
    "What do you call a priest that becomes a lawyer? A father-in-law.",
    "I was in a job interview the other day and they asked if I could perform under pressure. I said no, but I could perform Bohemian Rhapsody.",
    "Have you heard the joke about the butter? I better not tell you, it might spread!",
    "What did the police officer say to her belly button? You're under a vest!",
    "I have a joke about trickle down economics. But 99% of you will never get it.",
    "England doesn't have a kidney bank. But it does have a Liverpool.",
    "How many apples grow on a tree? All of them!",
    "What did the nose tell the finger? Stop picking on me!",
    "What’s a scarecrow’s favorite fruit? Straw-berries",
    "What happens when a frogs car dies? He needs a jump. If that doesn't work he has to get it toad.",
    "“Dad, can you explain to me what a solar eclipse is?” No sun.",
    "How do you get an astronaut’s baby to stop crying? You rocket.",
    "How did Darth Vader know what Luke got him for Christmas? He felt his presents!",
    "How can you tell an alligator from a crocodile? By paying attention to whether the animal will see you later, or after a while.",
    "Ever since we started quarantining, I've only been telling inside jokes.",
    "Dogs can't operate MRI machines but catscan.",
    "6:30 is my favorite time of day, hands down.",
    "I was going to tell a time-traveling joke, but you didn't like it.",
    "I'd avoid the sushi if I were you. It's a little fishy!",
    "Have you heard about those new corduroy pillows? They're making headlines.",
    "How do celebrities keep cool? They have many fans.",
    "What did the grape do when he got stepped on? He let out a little whine.",
    "I used to be addicted to the hokey-pokey until I turned myself around.",
    "I can tolerate algebra, maybe even a little calculus but geometry is where I draw the line.",
    "My friend said they were cold, so I told them to sit in a corner. It was 90 degrees.",
    "Last night I dreamt I was a muffler. I woke up exhausted.",
    "Our wedding was so beautiful, even the cake was in tiers.",
    "I hate jokes about german sausages, They're the wurst.",
    "\"Dad, I'm hungry.\" Hi Hungry, I'm Dad!",
    "What do you call somebody with no body and no nose? Nobody knows.",
    "\"Dad, can you put the cat out?\" I didn't know it was on fire!",
    "Wanna hear a joke about paper? Nevermind it's tearable.",
    "Why do bees hum? Because they don't know the words.",
    "\"Hey I'll call you later.\" Don't call me later, call me Dad.",
    "Did you hear about the guy who invented the knock knock joke? He won the 'no-bell' prize",
    "I am terrified of elevators, I'm going to start taking steps to avoid them.",
    "This graveyard looks overcrowded, people must be dying to get in there.",
    "Don't trust atoms, They make up everything.",
    "What do you call a sketchy Italian neighborhood? The Spaghetto.",
    "Did you hear about the factory that exploded in France? There was nothing left but de Brie.",
    "I knew I shouldn't have had the seafood, I'm feeling a little eel.",
    "I bought shoes from a drug dealer once, I don't know what he laced them with, but I was tripping all day.",
    "My wife is on a tropical food diet, the house is full of stuff, It's enough to make a mango crazy.",
    "What do you call a pony with a sore throat? A little horse.",
    "Dad, did you get a haircut? No I got them all cut.",
    "Dad, can you put my shoes on? No, I don't think they'll fit me.",
    "5/4 of people admit that they're bad with fractions.",
    "What do you call a fat psychic? A four-chin teller.",
    "I would avoid the sushi if I was you. It's a little fishy.",
    "I've never gone to a gun range before. I decided to give it a shot!",
    "What type of shoes do robbers wear? Sneakers.",
    "Everything is made in China. Except for babies. They're made in VaChina.",
    "Scientists found a new way to warm up in the winter: go to the corner of a room, it is always 90 degrees.",
    "At work we have a printer we nicknamed bob marley. It's always jammin'",
    "A guy walks into a bar, and he says: \"ouch\"",
    "What do you call a deer with no legs? a No-Eyed Deer.",
    "What do you call another deer with no legs? Still No-eyed deer.",
    "Today at the bank, an old lady asked me to check her balance, so I pushed her over.",
    "What is the best thing to take into the desert? A thirst-aid kit!",
    "Where do hampsters come from? Hampsterdam!",
    "What did the mayonnaise say to the dresser? Close the door I'm dressing.",
    "What did the judge say when Bill cut the cheese? Odor in the court!",
    "What do sweet potatoes wear to bed? Their yammies!",
    "What do you get when you cross an alien with a crybaby? An unidentified crying object!",
    "What did the hopeless romantic say to the photographer? \"Some day, my prints will come.\"",
    "what do you do with a guy like Fred who thinks hes a gift to women? You exchange him.",
    "What happens when you sing country music backwards? You get your job and your wife back.",
    "Why did the bone doctor take a vacation? He needed a break.",
    "What kind of camp do janitors go to? Sweep-away camp.",
    "What lies at the bottom of the sea and shivers? A nervous wreck!",
    "What do you call a monster that flies a kite in the middle of a lightning storm? Benjamin Franklinstein!",
    "Where do football directors go when they are fed up? The bored room!",
    "Why didn't the dog want to play football? He was a boxer.",
    "How do guys like shaggy sort their laundry? \"Dirty\", and \"Dirty but wearable\"",
    "Why did the traveler bring a hammer on vacation? He wanted to hit the road!",
    "Did you hear about the private beach? It's so exclusive, even the tide can't get in!",
    "What makes the Leaning Tower Of Pisa lean? It doesn't eat much.",
    "What is the most slippery country in the world? Greece!",
    "What is the worst thing you're likely to find in a school cafeteria? The food!",
    "Whats the difference between a teacher and a train? The teacher says \"Get that gum out of your mouth!\", the train says \"Chew Chew\"",
    "What's a forum? Two-um plus two-um!",
    "Why did the bald man put a rabbit on his head? He needed the hare!",
    "What did the apple say to the worm? You're boring me.",
    "What do you get when you drop a red hat into the red sea? A wet hat!",
    "What goes farther the slower it goes? Money.",
    "How can you make a slow horse fast? Don't give it anything to eat!",
    "How many lions can you put into an empty cage? One, after that it isn't empty anymore.",
    "How do you get an alien to sleep? You rocket.",
    "What do eye doctors check for? DaVision.",
    "What do you call a pig that knows karate? A porkchop!"
  ],
  "embarrassingThings": [
    "When are you going to tell that girlfriend you talk about (but don't have) that you're gay?",
    "Is this your girlfriend, son?",
    "OwO whats this? *nyuzzwes youw buwge*",
    "My steam library only has hentai games.",
    "I only go outside to buy food and not die.",
    "I jack off to My Little Pony porn every night.",
    "I stayed up to 9:01 PM, but my bedtime is 9:00 PM. TAKE THAT MOM!",
    "I am sexually attracted to nail clippings.",
    "I am a gamer, therefore, I am better than you.",
    "Naruto and Dragon Ball Z are the two greatest animes in the universe. Change my mind.",
    "I have 8 fursuits, one for each day, and one for when another is being cleaned.",
    "I torrented Fortnite.",
    "I own a bad dragon toy.",
    "I go onto r/funny daily.",
    "My parents follow me on social media.",
    "I play PC games with a Steam Controller.",
    "I own a cum sock and use it as a weapon.",
    "I listen to the billboard top 100 every week.",
    "I asked my parents for a PS Move for Christmas.",
    "I spend every bit of free time I have making shitty memes to hide my suicidal thoughts.",
    "I spent 2 hours learning how to make a new folder on my computer.",
    "I am part of the hacker group known as 4chan.",
    "I cried myself to sleep when I found out that my favorite chair had a dent in it.",
    "I've got a real pants shitting situation over here.",
    "I get legitimately scared when I play five nights at freddy's.",
    "I constantly think about my Mom and my sexual feelings toward her.",
    "It took me a full day to beat the first level of Super Mario Bros.",
    "I'm such an incompetent father that I can't even play catch with my son.",
    "I genuinely like the nutshack.",
    "I am a fan of [political figure].",
    "I held my pee in for a whole hour during fantastic beasts and where to find them.",
    "Video gamers rock! Brofist!",
    "I legitimately find Dad Bot funny.",
    "I have a 1 inch penis, erect.",
    "I respond with \"^\" to everything because I'm too dumb to have an original thought of my own.",
    "my favorite emote is :joy:",
    "I hate dad bot.",
    "I have a crush on the map from dora the explorer.",
    "I learned japanese to watch hentai.",
    "I couldn't teach my son how to ride a bike cause I can't ride one myself.",
    "I made a discord server where exactly 3 people joined, they were my alt accounts.",
    "I have a kink for Pajama's.",
    "I ran out of ideas.",
    "I set my favorite 3ds game to system settings because I thought I was being clever.",
    "I masturbate to some things that can't be public.",
    "I still wet the bed.",
    "I still play mario 64.",
    "I wanna fuck rowlet.",
    "I spam d!embarrass because I am very narcissistic and want to see my face on a bot.",
    "Does anyone here know how to download club penguin?",
    "Paul Blart: Mall Cop is my favorite movie.",
    "My dad works for minecraft don't fuck with me or he will hack you.",
    "I spent several weeks with no sleep making a shitty dad joke bot.",
    "I want to fuck litten.",
    "I have a crush on my chair.",
    "I set my status to invisible just to annoy my friends.",
    "I spent 48 hours working on a video to explain half a presses.",
    "delet this.",
    "I want to have sexual relations with a seal from pokemon.",
    "I want to die on a daily basis.",
    "I have toesucker in my Tinder bio.",
    "I once deep fried a vibrator.",
    "The last time I peed myself was a year ago.",
    "My porn collection is a stack of anatomy textbooks.",
    "The only time I ever go outside is for school.",
    "I go through 3 armpit towels everyday.",
    "The only girl I had a crush on was pinkalicious.",
    "I had to go through 1st grade more than once, 7 times to be exact.",
    "I still play Animal Crossing.",
    "Sans Undertale is my daddy.",
    "I still unironically have a crush on the Onceler.",
    "I have sexual fantasies about The Creator Of Homestuck, Andrew Hussie every night.",
    "I use Tumblr and I'm deeply in love with the Tumblr Staff.",
    "I jizz in my pants when I hear the word \"happiness\" because it has the sound \"penis\" at the end.",
    "I decided to taste the sweat in my armpit because I wondered if it tasted the same way it smelled.",
    "When no-one is looking, I twerk at myself in the mirror.",
    "I jack off in Goodwill changing stalls.",
    "I once peed in a coffee cup while in the middle of a video game marathon and I still drink coffee out of it.",
    "Hitler-chan is my favorite anime waifu.",
    "I'm too scared to meet real girls so I get my granny to show me her granddaughters.",
    "My Dad doesn't know I watch porn, I watch Hentai. Every time my Dad comes in, I just say I'm watching a cartoon.",
    "I'm jealous of people who look more attractive, so I mark their posts on tumblr as sexual to flag them down.",
    "I had sex with a cactus...",
    "Well I fucked up my sex life just cause I found a trap attractive.",
    "One time, I sneezed and my tampon shot out of me like a missile.",
    "One time when I was drunk, I offered to trade my best friend for Taco Bell.",
    "I use and throughly like airpods.",
    "Trollface is my favorite meme. PROBLEM?",
    "I had to practice French kissing with my cat for three years. Yeah he's still better at it than me...",
    "I watch hentai.",
    "If my octopus waifu were real, she'd be very disappointed in me.",
    "Do you no de wae???",
    "My grandma runs faster than me, and she's 95 with arthritis.",
    "Ur Dad gey LOLOLOLOL",
    "I was sitting on the toilet and my lips touched my dick on accident.",
    "I once masturbated to an extra thicc piece of wood.",
    "I have a crush on my siblings.",
    "I like to Google \"big clocks\" and sometimes I leave the L in clocks out on purpose ;)",
    "My dad taught me how to find gay hentai.",
    "I'm attracted to overweight Italian plumbers because I want to be like Princess Peach.",
    "I have a secret fetish for toes.",
    "Earth Chan is my go-to waifu.",
    "For Halloween I was a syphilitic donkey.",
    "I thought Shrek 3 wasn't bad.",
    "I think Uganda Knuckles is a funny and relevent meme.",
    "I own a sonic body pillow and I kiss it every night before I go to sleep.",
    "I just became a slut to a cottonswab.",
    "OMG Veggietales! My favorite anime!",
    "I unironically watch Ali-A.",
    "I'm subscribed to Morgz and his family.",
    "I got my parents to buy me a MacBook for gaming.",
    "yeah I post to r/dankmemes and r/dogelore",
    "I unironically use 69 in my usernames.",
    "I have a GameInformer subscription.",
    "Thanks for the gold kind stranger!",
    "Who's Brian and why is he in my head??!!",
    "My favorite anime is Boku no pico.",
    "I vomit over my girlfriend while she's sleeping and clean it all up before she wakes up.",
    "I watch incest porn on my tablet while I cook lasagna and broccoli with chocolate covered pudding.",
    "I got Twitch affiliate by cleaning my room on stream.",
    "I use Discord Light Theme.",
    "I wonder what the Annoying Orange would taste like!",
    "I farted and it stinks!",
    "I am madly in love with the Uh Oh Stinky monkey!",
    "I can't count the number of cum jars I have under my bed.",
    "I collect My Little Pony Figurines and keep them in their own jars.",
    "When I watch porn I flag the posts down for sexual content.",
    "If you peeled the Annoying Orange would his face be on the peel?",
    "Big toe."
  ],
  "mio": [
    "https://i.imgur.com/WJqCmO0.jpg",
    "https://i.imgur.com/Dl31e4s.jpg",
    "https://i.imgur.com/fKtq4yU.jpg",
    "https://i.imgur.com/HpFRgYA.jpg",
    "https://i.imgur.com/TvuAzuy.jpg",
    "https://i.imgur.com/Ll2I9UD.jpg",
    "https://i.imgur.com/sIrCa05.png",
    "https://i.imgur.com/oHj2bv4.jpg",
    "https://i.imgur.com/lk5byPK.jpg",
    "https://i.imgur.com/ihgNAOs.jpg",
    "https://i.imgur.com/pXGbvro.jpg",
    "https://i.imgur.com/spOJfM8.jpg",
    "https://i.imgur.com/nPFXGvX.jpg",
    "https://i.imgur.com/ovhlMeO.jpg",
    "https://i.imgur.com/M1NWWhI.jpg",
    "https://i.imgur.com/9G7fHm7.jpg",
    "https://i.imgur.com/bc3lpxn.jpg",
    "https://i.imgur.com/B4BvW2L.jpg",
    "https://i.imgur.com/EcTXutK.jpg",
    "https://i.imgur.com/LNG0tk7.jpg",
    "https://i.imgur.com/sTptjAF.jpg",
    "https://i.imgur.com/3BA3cvL.jpg",
    "https://i.imgur.com/3BA3cvL.jpg",
    "https://i.imgur.com/Pf4sdCG.jpg",
    "https://i.imgur.com/XZNWJ8R.jpg",
    "https://i.imgur.com/oISgaIA.jpg",
    "https://i.imgur.com/irrNoEG.jpg",
    "https://i.imgur.com/0ee4muM.jpg",
    "https://i.imgur.com/ninh7HF.jpg",
    "https://i.imgur.com/ddZhVj3.jpg",
    "https://i.imgur.com/HNCs0FP.jpg",
    "https://i.imgur.com/g2Sgush.jpg",
    "https://i.imgur.com/rUJstbs.jpg",
    "https://i.imgur.com/h7bc97d.jpg",
    "https://i.imgur.com/YGEabhW.png",
    "https://i.imgur.com/JlKdVZk.jpg",
    "https://i.imgur.com/YTcGryv.jpg",
    "https://i.imgur.com/PBF9LyE.jpg",
    "https://i.imgur.com/2UGokVT.jpg",
    "https://i.imgur.com/NmO2lhl.jpg",
    "https://i.imgur.com/HPKYvUJ.jpg",
    "https://i.imgur.com/PbAMmYd.jpg"
  ],
  "kumiko": [
    "https://i.imgur.com/Mkx6TgF.png",
    "https://i.imgur.com/WRWBtk6.png",
    "https://i.imgur.com/97KWSe8.png",
    "https://i.imgur.com/NDWPmOf.png",
    "https://i.imgur.com/U5khr9T.png",
    "https://i.imgur.com/cr695ef.png",
    "https://i.imgur.com/BxgfgMX.png",
    "https://i.imgur.com/EwaFkTJ.png",
    "https://i.imgur.com/u9CJHHa.png",
    "https://i.imgur.com/IWdHKs1.png",
    "https://i.imgur.com/viyaRJG.png",
    "https://i.imgur.com/oUhojhi.png",
    "https://i.imgur.com/WQPRSXm.png",
    "https://i.imgur.com/sGjQnKr.png",
    "https://i.imgur.com/zdAd4Va.png",
    "https://i.imgur.com/6pC5nEy.png",
    "https://i.imgur.com/ll5VaNU.png",
    "https://i.imgur.com/762g9js.png",
    "https://i.imgur.com/j4VitzI.png",
    "https://i.imgur.com/M9kbaaf.png",
    "https://i.imgur.com/ahExJmv.png",
    "https://i.imgur.com/d3RQ1PP.png",
    "https://i.imgur.com/kwC8mPm.png",
    "https://i.imgur.com/zduPkgo.png",
    "https://i.imgur.com/KG1Zvcw.png",
    "https://i.imgur.com/b6GvPIs.png",
    "https://i.imgur.com/Ri3nZxh.png",
    "https://i.imgur.com/gMjU8fE.png",
    "https://i.imgur.com/qz2MG61.png",
    "https://i.imgur.com/4MoIlrZ.png",
    "https://i.imgur.com/VjHCxqx.png",
    "https://i.imgur.com/fxAdmm7.png",
    "https://i.imgur.com/PG8Hlq8.png",
    "https://i.imgur.com/kzCGDEq.jpg",
    "https://i.imgur.com/YkhBpo7.png",
    "https://i.imgur.com/VDv4kXC.jpg",
    "https://i.imgur.com/kcu88yK.jpg",
    "https://cdn.discordapp.com/attachments/536982823631061014/618983481480839179/2Q.png",
    "https://cdn.discordapp.com/attachments/536982823631061014/618983437667401758/2Q.png",
    "https://cdn.discordapp.com/attachments/536982823631061014/618983342762754096/Z.png",
    "https://cdn.discordapp.com/attachments/536982823631061014/618983314581094420/Z.png"
  ],
  "dadsDabbing": [
    "https://cdn.discordapp.com/attachments/619304647462486026/619306673143676939/9k.png",
    "https://cdn.discordapp.com/attachments/619304647462486026/619306700054331402/Z.png",
    "https://cdn.discordapp.com/attachments/619304647462486026/619306774389981234/images.png",
    "https://cdn.discordapp.com/attachments/619304647462486026/619307838090510349/download_5.jpg",
    "https://cdn.discordapp.com/attachments/619304647462486026/619307875545907202/download_4.jpg",
    "https://cdn.discordapp.com/attachments/619304647462486026/619307994244448256/Z.png",
    "https://cdn.discordapp.com/attachments/619304647462486026/619308035038511104/2Q.png",
    "https://cdn.discordapp.com/attachments/619304647462486026/619308072505966659/Z.png",
    "https://cdn.discordapp.com/attachments/619304647462486026/619308111550742558/Z.png",
    "https://cdn.discordapp.com/attachments/619304647462486026/619308241314381834/images.png",
    "https://cdn.discordapp.com/attachments/619304647462486026/619308382125293601/qvruya7qth7z.png",
    "https://cdn.discordapp.com/attachments/619304647462486026/619308746685939732/9k.png",
    "https://cdn.discordapp.com/attachments/619304647462486026/619308884732936214/images.png"
  ],
  "advice": [
    "Being happy is not something that you can just say \"happy now\" and be happy, you first have to give up.",
    "It's ok to be gay, but it's not ok to be a gay furry.",
    "Don't push while you're in the bathroom, you'll blow a gasket.",
    "get off discord and go do something productive with your spare time",
    "if you get insulted say no u and if that doesn't work pull out the uno reverse card",
    "if you're poor be rich",
    "if your about to die, don't die",
    "Lol stands for Lots Of Love",
    "Eat enough beet roots and your poop will become pink",
    "if you eat enough carrots you turn ornage",
    "run",
    "if you're homeless just get a house.",
    "its never too early to give up, just too late."
  ]
}
